In [62]:
import pandas as pd
import numpy as np
import seaborn as sns

In [63]:
df=sns.load_dataset("titanic")

In [64]:
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [65]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [66]:
df.drop(columns=["pclass","embarked",'who', 'adult_male', 'deck',"alive","alone"],inplace=True)

In [67]:
df

     survived     sex   age  sibsp  parch     fare   class  embark_town
0           0    male  22.0      1      0   7.2500   Third  Southampton
1           1  female  38.0      1      0  71.2833   First    Cherbourg
2           1  female  26.0      0      0   7.9250   Third  Southampton
3           1  female  35.0      1      0  53.1000   First  Southampton
4           0    male  35.0      0      0   8.0500   Third  Southampton
..        ...     ...   ...    ...    ...      ...     ...          ...
886         0    male  27.0      0      0  13.0000  Second  Southampton
887         1  female  19.0      0      0  30.0000   First  Southampton
888         0  female   NaN      1      2  23.4500   Third  Southampton
889         1    male  26.0      0      0  30.0000   First    Cherbourg
890         0    male  32.0      0      0   7.7500   Third   Queenstown

[891 rows x 8 columns]

In [68]:
df["age"]=df["age"].fillna(df["age"].median())
df["embark_town"]=df["embark_town"].fillna(df["embark_town"].mode()[0])

In [69]:
df.isnull().sum().sum()

0

In [70]:
df.head(2)

   survived     sex   age  sibsp  parch     fare  class  embark_town
0         0    male  22.0      1      0   7.2500  Third  Southampton
1         1  female  38.0      1      0  71.2833  First    Cherbourg

## fetch the data where age of passengers >30

In [71]:
df1=df[df["age"]>30]
df1

     survived     sex   age  sibsp  parch     fare  class  embark_town
1           1  female  38.0      1      0  71.2833  First    Cherbourg
3           1  female  35.0      1      0  53.1000  First  Southampton
4           0    male  35.0      0      0   8.0500  Third  Southampton
6           0    male  54.0      0      0  51.8625  First  Southampton
11          1  female  58.0      0      0  26.5500  First  Southampton
..        ...     ...   ...    ...    ...      ...    ...          ...
873         0    male  47.0      0      0   9.0000  Third  Southampton
879         1  female  56.0      0      1  83.1583  First    Cherbourg
881         0    male  33.0      0      0   7.8958  Third  Southampton
885         0  female  39.0      0      5  29.1250  Third   Queenstown
890         0    male  32.0      0      0   7.7500  Third   Queenstown

[305 rows x 8 columns]

# or

In [72]:
indexes=np.where(df["age"]>30)

In [73]:
df.iloc[indexes]

     survived     sex   age  sibsp  parch     fare  class  embark_town
1           1  female  38.0      1      0  71.2833  First    Cherbourg
3           1  female  35.0      1      0  53.1000  First  Southampton
4           0    male  35.0      0      0   8.0500  Third  Southampton
6           0    male  54.0      0      0  51.8625  First  Southampton
11          1  female  58.0      0      0  26.5500  First  Southampton
..        ...     ...   ...    ...    ...      ...    ...          ...
873         0    male  47.0      0      0   9.0000  Third  Southampton
879         1  female  56.0      0      1  83.1583  First    Cherbourg
881         0    male  33.0      0      0   7.8958  Third  Southampton
885         0  female  39.0      0      5  29.1250  Third   Queenstown
890         0    male  32.0      0      0   7.7500  Third   Queenstown

[305 rows x 8 columns]

## how many passenegrs whose age> 30

In [74]:
len(df[df["age"]>30])

305

In [75]:
df[df["age"]>30].shape[0]

305

## how many passenegrs who spent the fare > avg fare spent by passenegrs

In [76]:
df["fare"].mean()

32.204207968574636

In [77]:
len(df[df["fare"]>df["fare"].mean()])

211

## filtering on multiple columns

## how many passengers who were travelling in first class and they were females

In [78]:
df["class"].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [79]:
len(df[((df["class"]=="First") & (df["sex"]=="female"))])

94

In [80]:
len(df[((df["class"]=="First") & (df["sex"]=="female"))])*100/df.shape[0]

10.549943883277217

## how many passengers who were travelling in first class or  they were females

In [81]:
len(df[((df["class"]=="First") | (df["sex"]=="female"))])

436

# fetch the subset of filtered data

## fetch the class of those passengers whose age is >30

In [82]:
df[df["age"]>30]["class"]

1      First
3      First
4      Third
6      First
11     First
       ...
873    Third
879    First
881    Third
885    Third
890    Third
Name: class, Length: 305, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

# aggregation operations on subset of filtered data

# find the average fare spent by  those passengers whose age is >30

In [83]:
df[df["age"]>30]["fare"].mean()

42.35290983606558

# mutiple aggregated operations on same column of filtered data

# find the average fare and toral fare spent by  those passengers whose age is >30

In [84]:
df[df["age"]>30]['fare'].agg(["mean","sum","max","min"])

mean       42.35291
sum     12917.63750
max       512.32920
min         0.00000
Name: fare, dtype: float64

# single  aggregated operations on different column of filtered data

## find the avg age and avg fare spent by those passenegrs who were travelling in first class

In [85]:
df[df["class"]=="First"][["age","fare"]].agg(["mean"])

           age       fare
mean  36.81213  84.154687

# different   aggregated operations on different column of filtered data

## find the avg age and total and min and max fare spent by those passenegrs who were travelling in first class

In [86]:
df[df["class"]=="First"][["age","fare"]].agg({"age":"mean","fare":["min","max","sum"]})

           age        fare
mean  36.81213         NaN
min        NaN      0.0000
max        NaN    512.3292
sum        NaN  18177.4125

#  of which class passengers were travelling whose age > 30

In [87]:
df[df["age"]>30]["class"].unique()

['First', 'Third', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

#  of which class passengers were travelling most and least whose age > 30

In [88]:
df[df["age"]>30]["class"].value_counts()

class
First     125
Third     103
Second     77
Name: count, dtype: int64

## who generated the business revenue most

In [89]:
df[df["sex"]=="female"]["fare"].sum()

13966.6628

In [90]:
df[df["sex"]=="male"]["fare"].sum()

14727.286500000002

# who survived or not survived most

In [91]:
df[df["survived"]==1]["sex"].value_counts()

sex
female    233
male      109
Name: count, dtype: int64

In [92]:
df[df["survived"]==0]["sex"].value_counts()

sex
male      468
female     81
Name: count, dtype: int64

In [93]:
len(df[((df["survived"]==0) &  (df["sex"]=="female"))])

81

In [94]:
len(df[((df["survived"]==0) &  (df["sex"]=="male"))])

468

In [95]:
len(df[((df["survived"]==1) &  (df["sex"]=="female"))])

233

In [96]:
len(df[((df["survived"]==1) &  (df["sex"]=="male"))])

109

## groupby

## find the avg fare spent by each class

In [97]:
df[df["class"]=="First"]["fare"].mean()

84.1546875

In [98]:
df[df["class"]=="Second"]["fare"].mean()

20.662183152173913

In [99]:
df[df["class"]=="Third"]["fare"].mean()

13.675550101832993

In [100]:
grp=df.groupby(["class"])
grp

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\53067920.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grp=df.groupby(["class"])

In [101]:
grp.get_group("Third")

     survived     sex   age  sibsp  parch     fare  class  embark_town
0           0    male  22.0      1      0   7.2500  Third  Southampton
2           1  female  26.0      0      0   7.9250  Third  Southampton
4           0    male  35.0      0      0   8.0500  Third  Southampton
5           0    male  28.0      0      0   8.4583  Third   Queenstown
7           0    male   2.0      3      1  21.0750  Third  Southampton
..        ...     ...   ...    ...    ...      ...    ...          ...
882         0  female  22.0      0      0  10.5167  Third  Southampton
884         0    male  25.0      0      0   7.0500  Third  Southampton
885         0  female  39.0      0      5  29.1250  Third   Queenstown
888         0  female  28.0      1      2  23.4500  Third  Southampton
890         0    male  32.0      0      0   7.7500  Third   Queenstown

[491 rows x 8 columns]

In [102]:
df.groupby(["class"])["fare"].agg(["mean"])

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\107103976.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["class"])["fare"].agg(["mean"])

             mean
class
First   84.154687
Second  20.662183
Third   13.675550

## how many male/females survived or not

In [103]:
x=df.groupby(["survived"])["sex"].agg(["value_counts"])
x

                 value_counts
survived sex
0        male             468
         female            81
1        female           233
         male             109

In [104]:
x.shape

(4, 1)

In [105]:
x=df.groupby(["survived"])["sex"].agg(["value_counts"]).unstack()
x

         value_counts
sex            female male
survived
0                  81  468
1                 233  109

In [106]:
x.shape

(2, 2)

## grouping based on multiple column

## of which class male or female survived or not  most and least

In [107]:
df.groupby(["survived","class"])["sex"].value_counts().to_frame().unstack()

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\3024714365.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["survived","class"])["sex"].value_counts().to_frame().unstack()

                 count
sex             female male
survived class
0        First       3   77
         Second      6   91
         Third      72  300
1        First      91   45
         Second     70   17
         Third      72   47

## avg fare and avg age of male and female passengers

In [108]:
df.groupby(["sex"])[["age","fare"]].agg(["mean"])

              age       fare
             mean       mean
sex
female  27.929936  44.479818
male    30.140676  25.523893

In [109]:
df.groupby(["sex"])[["age","fare"]].agg(["mean","min","max"])

              age                   fare
             mean   min   max       mean   min       max
sex
female  27.929936  0.75  63.0  44.479818  6.75  512.3292
male    30.140676  0.42  80.0  25.523893  0.00  512.3292

## total fare spent and avg age of each class

In [110]:
df.groupby(["class"])[["age","fare"]].agg({"age":"mean","fare":["sum","min","mean"]})

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\4265640173.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["class"])[["age","fare"]].agg({"age":"mean","fare":["sum","min","mean"]})

              age        fare
             mean         sum  min       mean
class
First   36.812130  18177.4125  0.0  84.154687
Second  29.765380   3801.8417  0.0  20.662183
Third   25.932627   6714.6951  0.0  13.675550

In [123]:
df=sns.load_dataset("tips")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

-  of which maximum size table booking was done?
- what was the peak time?
- who paid the maximum bill whether he was male or female?
- who contributed the most? smoker or non-smoker?
- who visited the most? female smokers or male smokers?
- on which day maximum tip given by whom? male or female?
- which was the peak day, from this analysis what business policy you want to recommend as a business analyst in order to grow the business?
- find out the average bill paid by male, female, smoker and non smoker?
- whether the single customer visited the restaurant or not?

 # of which maximum size table booking was done?

In [124]:
df["size"].max()

6

# what was the peak time?

In [113]:
df["time"].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

# who paid the maximum bill whether he was male or female?

In [114]:
df.groupby(["sex"])["total_bill"].max()

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\1372233.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["sex"])["total_bill"].max()

sex
Male      50.81
Female    44.30
Name: total_bill, dtype: float64

In [115]:
df[df["total_bill"]==df["total_bill"].max()]

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

## who contributed the most? smoker or non-smoker?

In [116]:
df.groupby(["smoker"])["total_bill"].sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\699755606.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["smoker"])["total_bill"].sum()

smoker
Yes    1930.34
No     2897.43
Name: total_bill, dtype: float64

## who visited the most? female smokers or male smokers?

In [117]:
df[df["smoker"]=="Yes"]["sex"].value_counts()

sex
Male      60
Female    33
Name: count, dtype: int64

## on which day maximum tip given by whom? male or female?

In [118]:
df[df["tip"]==df["tip"].max()]["day"].values

['Sat']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

## which was the peak day, from this analysis what business policy you want to recommend as a business analyst in order to grow the business?

In [119]:
df["day"].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

## find out the average bill paid by male, female, smoker and non smoker?

In [120]:
df.groupby(["sex","smoker"])["total_bill"].agg(["mean"])

C:\Users\HP\AppData\Local\Temp\ipykernel_8196\2370274160.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["sex","smoker"])["total_bill"].agg(["mean"])

                    mean
sex    smoker
Male   Yes     22.284500
       No      19.791237
Female Yes     17.977879
       No      18.105185

## whether the single customer visited the restaurant or not?

In [121]:
df["size"].min()

1

In [122]:
df["size"].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)